Manazon/app/models/user.rb

SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "plslol1fkin123"], ["LIMIT", 1]]
---
    def self.find_by_credentials(un, pw)
        user = User.find_by(username: un)

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "KgsXomuG_EZd4RQ4VDMyhA"], ["updated_at", "2021-09-05 00:51:32.780397"], ["id", 8]]
---
    def reset_session_token!
        self.session_token = SecureRandom.urlsafe_base64(16)
        self.save